## Step 2 - Database Engineering

Use SQLAlchemy to model your table schemas and create a sqlite database for your tables. You will need one table for measurements and one for stations.

* Create a Jupyter Notebook called `database_engineering.ipynb` and use this to complete all of your Database Engineering work.

* Use Pandas to read your cleaned measurements and stations CSV data.

* Use the `engine` and connection string to create a database called `hawaii.sqlite`.

* Use `declarative_base` and create ORM classes for each table.

  * You will need a class for `Measurement` and for `Station`.

  * Make sure to define your primary keys.

* Once you have your ORM classes defined, create the tables in the database using `create_all`.

In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
# Import SQL Alchemy
from sqlalchemy import create_engine

# Import PyMySQL (Not needed if mysqlclient is installed)
import pymysql
pymysql.install_as_MySQLdb()

# Import and establish Base for which classes will be constructed 
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()

# Import modules to declare columns and column data types
from sqlalchemy import Column, Integer, String, Float

import pandas as pd

In [3]:
Base = declarative_base()
measurements_df = pd.read_csv('clean_hawaii_measurements.csv')
stations_df = pd.read_csv('Resources/hawaii_stations.csv')

stations_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
station      9 non-null object
name         9 non-null object
latitude     9 non-null float64
longitude    9 non-null float64
elevation    9 non-null float64
dtypes: float64(3), object(2)
memory usage: 440.0+ bytes

In [4]:
measurements_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19550 entries, 0 to 19549
Data columns (total 4 columns):
station    19550 non-null object
date       19550 non-null object
prcp       19550 non-null float64
tobs       19550 non-null int64
dtypes: float64(1), int64(1), object(2)
memory usage: 611.0+ KB

In [5]:
type(measurements_df.station[0])

str

In [6]:
stations_df.latitude[0]

21.271599999999999

In [7]:
measurements_df.station[0]

'USC00519397'

In [8]:
# class Station(Base):
#     __tablename__ = 'station'
#     id = Column(Integer, primary_key=True)
#     station = Column(String)
#     latitude = Column(Float)
#     longitude = Column(Float)
#     elevation = Column(Float)

# class Measurement(Base):
#     __tablename__ = 'measurement'
#     id = Column(Integer, primary_key=True)
#     station = Column(String)
#     date = Column(String)
#     prcp = Column(Float)
#     tobs = Column(Integer)

In [17]:
# Creating database
import sqlite3

con = sqlite3.connect("hawaii.sqlite")

In [30]:
# this part was tough, but google helped
# measurements table - appends to hawaii.sqlite
measurements_df.to_sql('measurement', con, if_exists='replace', index=True)

# stations table - appends to hawaii.sqlite
stations_df.to_sql('station', con, if_exists='replace', index=True)

In [31]:
# engine = create_engine("mysql://root:@localhost/hawaii", echo=False)
# conn = engine.connect()

In [48]:
df = pd.read_sql_query("SELECT * FROM measurement", con)
df.head()

# con.close()

   index      station        date  prcp  tobs
0      0  USC00519397  2010-01-01  0.08    65
1      1  USC00519397  2010-01-02  0.00    63
2      2  USC00519397  2010-01-03  0.00    74
3      3  USC00519397  2010-01-04  0.00    76
4      4  USC00519397  2010-01-06  0.00    73

In [49]:
df1 = pd.read_sql_query("SELECT * FROM station", con)
df1.head()
# con.close()

,index,station,name,latitude,longitude,elevation
0,0,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0
1,1,USC00513117,"KANEOHE 838.1, HI US",21.4234,-157.8015,14.6
2,2,USC00514830,"KUALOA RANCH HEADQUARTERS 886.9, HI US",21.5213,-157.8374,7.0
3,3,USC00517948,"PEARL CITY, HI US",21.3934,-157.9751,11.9
4,4,USC00518838,"UPPER WAHIAWA 874.3, HI US",21.4992,-158.0111,306.6

In [50]:
df.head()

   index      station        date  prcp  tobs
0      0  USC00519397  2010-01-01  0.08    65
1      1  USC00519397  2010-01-02  0.00    63
2      2  USC00519397  2010-01-03  0.00    74
3      3  USC00519397  2010-01-04  0.00    76
4      4  USC00519397  2010-01-06  0.00    73